In [3]:
import pandas as pd 
import numpy as np
#from sklearn import preprocessing

# Q1: Apply Ordinal encoding.

In [4]:
df = pd.DataFrame({'names': ['ahmed', 'saeed', 'khalid', 'ali', 'faris'],
                   'rating': ['Very Unhappy', 'Unhappy', 'Neutral', 'happy', 'Very Unhappy'],
                  'salary': [7000, 5300, 8000, 11000, 15000]})

In [5]:
from sklearn.preprocessing import OrdinalEncoder
enc = OrdinalEncoder()
fit = enc.fit_transform(df[['rating']])
df['rating']

0    Very Unhappy
1         Unhappy
2         Neutral
3           happy
4    Very Unhappy
Name: rating, dtype: object

In [6]:
df

    names        rating  salary
0   ahmed  Very Unhappy    7000
1   saeed       Unhappy    5300
2  khalid       Neutral    8000
3     ali         happy   11000
4   faris  Very Unhappy   15000

# Q2: Apply One hot encoding.

In [7]:
from sklearn.preprocessing import OneHotEncoder
color = pd.DataFrame({'colors': ['red', 'blue', 'green', 'yellow']})
encOH = OneHotEncoder(sparse=False)
new = encOH.fit_transform(color)
new

array([[0., 0., 1., 0.],
       [1., 0., 0., 0.],
       [0., 1., 0., 0.],
       [0., 0., 0., 1.]])

In [8]:
color

   colors
0     red
1    blue
2   green
3  yellow

# Q3: Apply Frequency Encoding.

In [46]:
from sklearn.feature_extraction.text import CountVectorizer
weather = ['hot', 'cold', 'hot', 'warm', 'cold', 'hot'] 

fe = CountVectorizer()
fe_fit = fe.fit_transform(weather)

print(fe_fit.toarray().sum(axis=0))

[2 3 1]

# Q4: Apply Binary Encoding.

In [16]:
from category_encoders import BinaryEncoder

In [29]:
bi = BinaryEncoder()
bi_enc = bi.fit_transform(df['rating'])
bi_enc

   rating_0  rating_1  rating_2
0         0         0         1
1         0         1         0
2         0         1         1
3         1         0         0
4         0         0         1

In [30]:
enc_df = pd.concat([df, bi_enc], axis=1)
enc_df

    names        rating  salary  rating_0  rating_1  rating_2
0   ahmed  Very Unhappy    7000         0         0         1
1   saeed       Unhappy    5300         0         1         0
2  khalid       Neutral    8000         0         1         1
3     ali         happy   11000         1         0         0
4   faris  Very Unhappy   15000         0         0         1